<template>
  <div class="reader">
    <div class="reader__top">第一章 人间美味</div>
    <div class="reader__content" @click="showTools">
      <article class="reader__article">
        <div class="title">第一章 人间美味</div>
        <section class="content">
          <p>平行时空—176943号蓝星。</p>
          <p>……</p>
          <p>华国岭南。</p>
          <p>
            汕美城区郊外，在经济不发达的城区中，依旧保留着许多老味道，还有家族宗祀的传统。
          </p>
          <p>
            晨光微微，青苔村便炊烟袅袅升起，不少去信利电子厂上班的年轻人，已经一大早在村门口等着公交车。
          </p>
          <p>
            12路公交车带着柴油机特有的低沉，缓缓停靠村口前仅有的公交站。几个去电子厂上班的年轻人，连忙投币上了公交车。
          </p>
          <p>公交车再一次起步。</p>
          <p>
            一辆丰田卡罗拉，在村口的停了一下，副驾驶车窗被按下一半，戴墨镜的淡妆女子，轻轻提了下墨镜。
          </p>
          <p>“青苔村?”</p>
          <p>“彩姐，就是这里。”</p>
          <p>……</p>
          <p>古朴又略带一丝雅致的小别墅里。</p>
          <p>一家四口正在吃着早餐。</p>
          <p>餐桌上，一小碟腌橄榄、一小碟橄榄菜、一小盘清炒菠菜。</p>
          <p>
            温柔的中年妇女将两颗咸鸭蛋对半切好，然后将其中含着流油蛋黄的一半，递给一个十六七岁的少年。
          </p>
          <p>“老妈真偏心！”一旁马尾少女嘟着嘴念叨着。</p>
          <p>
            “你吃了又要长痘痘，要不要?”中年妇女将另一块含着蛋黄的咸鸭蛋递过去。
          </p>
          <p>少女摆摆手：“给老爸。”</p>
          <p>
            如果是往常，少年非得和姐姐斗嘴一番，今天却一反常态的埋头扒着白粥。
          </p>
          <p>一家之主的中年男人抬了抬眼镜，看了一眼儿子：“有什么话想说?”</p>
          <p>“我……”少年欲言又止。</p>
          <p>
            “明哲，都是一家人，有什么事别藏心里。”妇女温柔的说道，又不留痕迹的瞄了一眼丈夫。
          </p>
          <p>少年鼓起勇气：“有一个艺人经纪公司想招我去当练习生，我……”</p>
          <p>“你打算当练习生?”中年男人眉头一皱。</p>
          <p>
            “是的，我有自己的梦想，我不想当什么工程师。”少年越说越显得激动，仿佛在发泄心中的不满和不甘。
          </p>
          <p>叛逆期的少年，总是对于家长的指手画脚和人生安排非常反感。</p>
          <p>
            “……”中年男人盯着倔强的少年，久久不语的沉默着，他夹起一颗腌橄榄，扒了几口白粥。
          </p>
          <p>
            一时间，餐桌上一家四口都沉默了下来，中年男人放下手上的碗筷，起身向二楼卧室走去。
          </p>
          <p>少年也草草将一碗粥吃完，便回自己房间收拾行李。</p>
          <p>丰田卡罗拉缓缓停在别墅门口。</p>
          <p>红砖围墙爬着青苔，半院云南早樱此时正红。</p>
          <p>那墨镜女子打开车门，刚想去敲门。</p>
          <p>
            少年和他母亲就一起出来了，少年拉着行李箱，母亲则关心的嘱咐着什么家长里短。
          </p>
          <p>
            “你好，我是圣美文化娱乐公司的经纪人胡彩，这是我的名片。”胡彩微笑着递过来一张名片。
          </p>
          <p>突然一只略带粗糙的手接过来名片。</p>
          <p>“额?你是?”胡彩一愣。</p>
          <p>“我是黄明哲的父亲，进来谈一谈吧！”</p>
          <p>“没问题。”</p>
          <p>
            胡彩和中年男子径直进入别墅客厅，黄明哲刚想跟过去，却被母亲一把拉住。
          </p>
          <p>客厅，红木桌上两杯清茶。</p>
          <p>
            中年男子看了看笔记本电脑的情况，随即面无表情的问道：“合同在哪里?”
          </p>
          <p>
            尽管摸不清眼前这个中年男子的想法，但是胡彩还是非常有职业素养，从公文包中取出两份制式合同。
          </p>
          <p>接过合同，中年男子仔细的翻看着，不时地抬了抬眼镜。</p>
          <p>
            “黄先生，我们公司是非常有诚意的，毕竟明哲外貌、声线、才艺都不错，未来可以……”
          </p>
          <p>“他有几斤几两我心知肚明。”中年男子在监护人一栏签了名。</p>
          <p>
            胡彩对于中年男子的态度和举动大感意外，本来她还以为对方会狮子大开口之类的，没想到却平静得有些过分。
          </p>
          <p>
            而黄明哲也没有想到自己古板的父亲，竟然会同意自己去当练习生，他整个人都懵了，一肚子话都难以启齿。
          </p>
          <p>他浑浑噩噩的上了车。</p>
          <p>“如果你后悔了，就回来吧！我把一切都留在老屋哪里。”</p>
          <p>
            什么?黄明哲疑惑的抬起头，却只见父亲的背影，以及母亲担忧的眼神、姐姐比着小拳头。
          </p>
          <p>丰田卡罗拉在乡间的小道上渐行渐远。</p>
          <p>……</p>
          <p>时代的潮流势不可挡。</p>
          <p>
            光鲜亮丽的舞台上，有人意气风发；地下出租屋的蜗居里，有人馒头泡面。
          </p>
          <p>东昌地铁站出口附近。</p>
          <p>
            带着兜帽的年轻人，用那粗糙的手弹奏着木吉他，略带沧桑的嗓音低声浅吟着：
          </p>
          <p>
            “也许低下头会哭泣，也许六月雪要飞进心里……在人间有谁活着，不像是一场炼狱，我不哭我已经没有尊严能放弃……”
          </p>
          <p>不时有路人慷慨解囊，也有面露鄙夷之色，更多是冷漠的擦肩而过。</p>
          <p>
            北上广深每一天都有怀着梦想的菜鸟冲进来，也有被现实压得喘不过气的失败者逃离。
          </p>
          <p>不甘又如何，这就是命。</p>
          <p>
            兜帽年轻人唱得声情并茂，那低沉的悲鸣，仿佛在竭斯底里的诉说着命途多舛。
          </p>
          <p>
            但是路人更多已经麻木不仁，激情早已经被生活磨去棱角，热血抵挡不住柴米油盐。
          </p>
          <p>
            直到声音有些沙哑，兜帽年轻人看了看手表，便双手合十向周围寥寥无几的观众，说了一声谢谢捧场。
          </p>
          <p>他将木吉他放入皮夹袋中，并没有清点观众的打赏。</p>
          <p>
            路过一家快餐店，随随便便打了一个快餐，此时已经夕阳西下，落日余晖却没有让魔都的节奏慢下来。
          </p>
          <p>
            突然他在一处广告牌旁停下来脚步，原来是一个叫华国好声音的选秀节目广告。
          </p>
          <p>随即他又自嘲的摇了摇头，头也不回的出租屋方向走。</p>
          <p>小小的出租屋里面。</p>
          <p>
            年轻人洗了一把脸，看着镜子对面的容貌，帅气青涩中带着成熟，还有一丝丝倔强。
          </p>
          <p>
            低矮的廉价塑料椅子，他一口一口扒着米饭和卤肉，米饭有些干硬，连忙拿起杯子。
          </p>
          <p>
            喝了一口白开水，他突然停了一下，放下手上的筷子，将床头柜上的相框拿起来，沉默不语的擦了擦。
          </p>
          <p>相框里一家四口，泪珠轻轻滑落，他嘴唇微张，却不知说什么。</p>
          <p>……</p>
          <p>深汕高速汕美段。</p>
          <p>低沉的汽车发动机，显得格外刺耳。</p>
          <p>
            正驾驶上，那人叼着皱巴巴的卷烟吞云吐雾，透过乱糟糟头发，隐隐约约可以看到那沟壑纵横的苍老脸庞。
          </p>
          <p>前面一片黑暗，他的猛禽150只剩下一边车大灯。</p>
          <p>
            高速公路两侧是那样的漆黑，宛如万丈深渊，一阵阵强风灌入车窗，昏暗的天空渐渐飘下雪花。
          </p>
          <p>“咳咳……”那人一边咳嗽一边死死地抓住方向盘。</p>
          <p>
            车速只有三十多公里每小时，道路非常颠簸，不时有杂物出现在路中间，但是那人左眼中的目光却是坚定不移，那眼神似乎有光。
          </p>
          <p>风雪中，皮卡慢慢停下来。</p>
          <p>
            他看了一眼前方，高速出口收费站上方，只剩下硕果仅存的“长沙……口”三个字牌。
          </p>
          <p>
            锈迹斑斑的铁栏杆横卧路中间，一层薄薄的积雪覆盖着收费站和道路。
          </p>
          <p>
            车门打开，那人从副驾驶抽出一把消防斧，步履阑珊的走向前面，看着眼前空无一人的高速出口，他没有意外，只有一丝丝落寞。
          </p>
          <p>吃力的清理出一条车道。</p>
          <p>
            “咳咳……呼呼……”他捂住嘴，仿佛要将心肝脾肺都咳出来，那脖子上的围巾是那样的红，就如同一块新鲜猪肝。
          </p>
          <p>他疲惫的靠在收费站板房墙，大口大口的喘着粗气。</p>
          <p>不，我不能倒下……</p>
          <p>雪花飘零，那清澈的木吉他声，从远处传来。</p>
          <p>
            老人的目光渐渐涣散，仿佛那梦幻泡影，破碎成一群色彩斑斓的蝴蝶。
          </p>
          <p>梦乎?</p>
          <p>蝶乎?</p>
          <p>己为何乎?</p>
          <p />
        </section>
      </article>
    </div>
    <read-tools
      :visible.sync="toolVisible"
      @menu="handleMenu"
      @set="handleSet"
    />
    <chapter-catalogue :visible.sync="chapterVisible" />
  </div>
</template>

<script>
  import ChapterCatalogue from '@components/menu/ChapterCatalogue'
  import ReadTools from '@components/menu/ReadTools'
  export default {
    name: 'DetailReaders',
    components: {
      ReadTools,
      ChapterCatalogue
    },
    data() {
      return {
        toolVisible: false,
        chapterVisible: false
      }
    },
    methods: {
      showTools() {
        this.toolVisible = true
      },
      handleMenu() {
        this.chapterVisible = true
      },
      handleSet() {
        this.$toast({
          message: '功能开发中...',
          icon: 'fire'
        })
      }
    }
  }
</script>

<style lang="scss" scoped>
  .reader {
    background-color: #c4b395;
    &__top {
      position: fixed;
      top: 0;
      right: 0;
      left: 0;
      height: 44px;
      line-height: 44px;
      color: rgba($color: $color-black, $alpha: 0.4);
      padding: 0 16px;
      background: url('~@assets/images/base/skin-default-t.jpg') no-repeat
        center top;
      background-size: 100%;
    }
    &__content {
      padding-top: 44px;
      background: url('~@assets/images/base/skin-default-t.jpg') no-repeat
          center top,
        url('~@assets/images/base/skin-default-b.jpg') no-repeat center bottom,
        url('~@assets/images/base/skin-default-m.jpg') repeat-y center 119px;
      background-size: 100%;
    }
    &__article {
      color: rgba($color: $color-black, $alpha: 0.85);
      padding: 0 16px;
      .title {
        font-size: 26px;
        padding: 30px 0;
        text-align: center;
      }
      .content {
        font-size: 18px;
        padding-bottom: 16px;
        text-align: justify;
      }
    }
  }
</style>
